IDEA StatiCa Open Model
RebarPoint3D.BendRadius Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the radius of the Arc
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double BendRadius { get; set; }
Public Property BendRadius As Double
	Get
	Set
public:
property double BendRadius {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
RebarPoint3D Class
IdeaRS.OpenModel.Model Namespace